modules/Hotel/Models/Hotel.php

select count(`bc_hotels`.`id`) as aggregate from `bc_hotels` inner join `bc_locations` on `bc_locations`.`id` = `bc_hotels`.`location_id` and `bc_locations`.`_lft` >= 1 and `bc_locations`.`_rgt` <= 2 where `bc_hotels`.`status` = 'publish' and `bc_hotels`.`deleted_at` is null
---
    public function getNumberServiceInLocation($location)
    {
        $number = 0;
        if (!empty($location)) {
            $number = parent::join('bc_locations', function ($join) use ($location) {
                $join->on('bc_locations.id', '=', $this->table . '.location_id')->where('bc_locations._lft', '>=', $location->_lft)->where('bc_locations._rgt', '<=', $location->_rgt);
            })->where($this->table . ".status", "publish")->with(['translation'])->count($this->table . ".id");