modules/Tour/Models/Tour.php

    public function getNumberServiceInLocation($location)
    {
        $number = 0;
        if (!empty($location)) {
            $number = parent::join('bc_locations', function ($join) use ($location) {
                $join->on('bc_locations.id', '=', 'bc_tours.location_id')->where('bc_locations._lft', '>=', $location->_lft)->where('bc_locations._rgt', '<=', $location->_rgt);
            })->where("bc_tours.status", "publish")->with(['translation'])->count("bc_tours.id");
---
select count(`bc_tours`.`id`) as aggregate from `bc_tours` inner join `bc_locations` on `bc_locations`.`id` = `bc_tours`.`location_id` and `bc_locations`.`_lft` >= 1 and `bc_locations`.`_rgt` <= 2 where `bc_tours`.`status` = 'publish' and `bc_tours`.`deleted_at` is null