app/User.php

select count(`id`) as aggregate from `users` where `verify_submit_status` in ('new', 'partial') and `users`.`deleted_at` is null
---
    public static function countVerifyRequest()
    {
        return parent::query()->whereIn('verify_submit_status', ['new', 'partial'])->count(['id']);

select count(`id`) as aggregate from `ch_messages` where `to_id` = 12 and `from_id` != 12 and `seen` = 0
---
    public function getUnseenMessageCountAttribute()
    {
        return Message::query()->where('to_id', $this->id)->where('from_id', '!=', $this->id)->where('seen', 0)->count(['id']);