app/Helpers/AppHelper.php

function setting_update_item($item, $val)
{

    $s = Settings::where('name', $item)->first();
---
select * from `core_settings` where `name` = 'email_driver' limit 1